---
title: ValueAtPointBase
classe: Autodesk.Revit.DB.ValueAtPointBase
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ValueAtPointBase

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `valueAtPointBase.IsValidObject` | Boolean |
| `Void ClearAllFlags()` | `valueAtPointBase.ClearAllFlags()` | Void |
| `Void ClearFlagsAt(Int32)` | `valueAtPointBase.ClearFlagsAt(measurement)` | Void |
| `Void Dispose()` | `valueAtPointBase.Dispose()` | Void |
| `Int32 GetFlags(Int32)` | `valueAtPointBase.GetFlags(measurement)` | Int32 |
| `Void SetFlags(Int32, Int32)` | `valueAtPointBase.SetFlags(flags, measurement)` | Void |
| `Void SetFlags(Int32)` | `valueAtPointBase.SetFlags(flags)` | Void |
| `Void SetFlags(IList<Int32>)` | `valueAtPointBase.SetFlags(flags)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```